In [1]:
# Handling missing data
import pandas as pd
import numpy as np

In [2]:
# pandas exclude missing data by default while doing calculation
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [3]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [4]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [5]:
# filtering using boolean masking
string_data[string_data.isnull()]

2    NaN
dtype: object

In [6]:
from numpy import nan as NA

In [7]:
# filtering out the missing data
data = pd.Series([1, NA, 3.5, NA, 7])

In [8]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [9]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],[NA, NA, NA], [NA, 6.5, 3.]])

In [10]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [11]:
data.dropna(axis=0) 
# drop rows with all NAN

     0    1    2
0  1.0  6.5  3.0

In [12]:
# drop a column with all NAN
data.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [13]:
df = pd.DataFrame(np.random.randn(7, 3))

In [14]:
df

          0         1         2
0  0.337024  0.558759 -0.930200
1  0.987139  0.170158  0.773413
2 -0.982518  0.877095 -0.605431
3 -1.161100  0.001059  0.829841
4  0.499537 -0.316968 -0.295508
5 -1.003506 -0.854079  0.047376
6  1.777542  0.194362 -0.536364

In [15]:
df.iloc[:4,1] = NA 
df.iloc[:2,2] = NA

In [16]:
df

          0         1         2
0  0.337024       NaN       NaN
1  0.987139       NaN       NaN
2 -0.982518       NaN -0.605431
3 -1.161100       NaN  0.829841
4  0.499537 -0.316968 -0.295508
5 -1.003506 -0.854079  0.047376
6  1.777542  0.194362 -0.536364

In [17]:
df.dropna() 
# implicitly axis 0

          0         1         2
4  0.499537 -0.316968 -0.295508
5 -1.003506 -0.854079  0.047376
6  1.777542  0.194362 -0.536364

In [18]:
df.dropna(axis=0)

          0         1         2
4  0.499537 -0.316968 -0.295508
5 -1.003506 -0.854079  0.047376
6  1.777542  0.194362 -0.536364

In [19]:
df.dropna(axis=1)

          0
0  0.337024
1  0.987139
2 -0.982518
3 -1.161100
4  0.499537
5 -1.003506
6  1.777542

In [20]:
df.dropna(axis=0,thresh=2) 
# drop rows where NAN>=2

          0         1         2
2 -0.982518       NaN -0.605431
3 -1.161100       NaN  0.829841
4  0.499537 -0.316968 -0.295508
5 -1.003506 -0.854079  0.047376
6  1.777542  0.194362 -0.536364

In [21]:
# Filling out missing values

In [22]:
df

          0         1         2
0  0.337024       NaN       NaN
1  0.987139       NaN       NaN
2 -0.982518       NaN -0.605431
3 -1.161100       NaN  0.829841
4  0.499537 -0.316968 -0.295508
5 -1.003506 -0.854079  0.047376
6  1.777542  0.194362 -0.536364

In [23]:
df.fillna(0)

          0         1         2
0  0.337024  0.000000  0.000000
1  0.987139  0.000000  0.000000
2 -0.982518  0.000000 -0.605431
3 -1.161100  0.000000  0.829841
4  0.499537 -0.316968 -0.295508
5 -1.003506 -0.854079  0.047376
6  1.777542  0.194362 -0.536364

In [24]:
# filling out diff values for each cols
df.fillna({1:0.5,2:0})

          0         1         2
0  0.337024  0.500000  0.000000
1  0.987139  0.500000  0.000000
2 -0.982518  0.500000 -0.605431
3 -1.161100  0.500000  0.829841
4  0.499537 -0.316968 -0.295508
5 -1.003506 -0.854079  0.047376
6  1.777542  0.194362 -0.536364

In [25]:
# DATA TRANSFORMATION

In [26]:
# Removing duplicates

In [27]:
# removing duplicate rows
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],'k2': [1, 1, 2, 3, 3, 4, 4]})

In [28]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [29]:
# finding out duplication
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

Data Transformation

In [30]:
# Removing duplicates

In [31]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
'k2': [1, 1, 2, 3, 3, 4, 4]})

In [32]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [33]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [34]:
# notice rrow 5,6 have same values

In [35]:
# you can use drop duplicates

In [36]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [37]:
# by default they consider all columns

In [38]:
data['v1'] =  range(7)

In [39]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [40]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
dtype: bool

In [41]:
# now it is all false

In [42]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [43]:
data.drop_duplicates(['k1','k2'])

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5

In [44]:
# by default they keep the first observed value combination

In [45]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [46]:
# you can drop the last too
data.drop_duplicates(['k1','k2'],keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [47]:
# Transforming Data using a Function or Mapping

In [48]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
'Pastrami', 'corned beef', 'Bacon',
'pastrami', 'honey ham', 'nova lox'],
'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [49]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [50]:
# suppose I want a column where food source maps to each animal

In [51]:
# lets define the mapping first

In [52]:
meat_to_animal = {
'bacon': 'pig',
'pulled pork': 'pig',
'pastrami': 'cow',
'corned beef': 'cow',
'honey ham': 'pig',
'nova lox': 'salmon'
}

In [53]:
# just a bit preprocessing
lowercased = data['food'].str.lower()

In [54]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [55]:
data['animal'] = lowercased.map(meat_to_animal)
# meat-to-animal
# key: meat , value: animal

In [56]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [57]:
# MAPS transform a series containing KEYS to values

In [58]:
# you can use lambda function to do that